---
kind: method
id: M:Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.Dispose
source: html/0a595a4e-97f1-9385-bafd-a0debe50f468.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationConverter.Dispose Method

Releases all resources used by the DesignToFabricationConverter

## Syntax (C#)
```csharp
public void Dispose()
```